# 字符串格式化: %s ；
# 需求：定义变量 name = 'wslixiaoliang',输出：大家好，我的名字叫：wslixiaoliang 请多多关照'
print()
name = 'wslixiaoliang'
print('大家好，我的名字叫：%s 请多多关照' % name)
print('==========================================================')

# 格式化输出整数变量: %d,%06d:表示输出的整数位数，不足6为前面用0补齐，6表示输出的位数，可以变化；
# 需求 输出我的工号是：000001；
number = 1
print('我的工号是：%06d' % number)
print('==========================================================')

# 格式化输出：浮点数 %f, %.2f 表示保留两位小数
# 需求：定义变量：price,weight,money,输出：苹果的单价 2.5 元，我买了10斤苹果，一共 25元；
price = float(input('输入苹果单价：'))
weight = float(input('输入苹果的重量：'))
money = price * weight
print('苹果的单价是：%.2f 元/斤,我买了 %.2f 斤，一共 %.2f 元' % (price, weight, money))
print('==========================================================')

# 格式化输出：百分比 %
# 需求：定义 scale = 0.25 ,输出 ：数据比例：25%
scale = 0.25 * 100
print('数据比例：%.2f%%' % scale)
print('==========================================================')



